# Malaysian National Registration Identity Card Numbers

## Introduction

The function `clean_my_nric()` cleans a column containing Malaysian National Registration Identity Card Number (NRIC) strings, and standardizes them in a given format. The function `validate_my_nric()` validates either a single NRIC strings, a column of NRIC strings or a DataFrame of NRIC strings, returning `True` if the value is valid, and `False` otherwise.

NRIC strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "770305021234"
* `standard`: NRIC strings with proper whitespace in the proper places, like "770305-02-1234"
* `birthdate`: return the registration date or the birth date, like "1977-03-05".
* `birthplace`: return a dict containing the birthplace of the person, like {'state': 'Kedah', 'country': 'Malaysia', 'countries': 'Malaysia'}.

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_my_nric()` and `validate_my_nric()`.

### An example dataset containing NRIC strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "nric": [
            "770305021234",
            "771305-02-1234",
            "999 999 999",
            "004085616",
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

             nric                                           address
0    770305021234                                     123 Pine Ave.
1  771305-02-1234                                           main st
2     999 999 999                      1234 west main heights 57033
3       004085616                    apt 1 789 s maple rd manhattan
4     002 724 334                robie house, 789 north main street
5           hello         1111 S Figueroa St, Los Angeles, CA 90015
6             NaN  (staples center) 1111 S Figueroa St, Los Angeles
7            NULL                                             hello

## 1. Default `clean_my_nric`

By default, `clean_my_nric` will clean nric strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_my_nric
clean_my_nric(df, column = "nric")

,nric,address,nric_clean
0,770305021234,123 Pine Ave.,770305-02-1234
1,771305-02-1234,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_my_nric(df, column = "nric", output_format="standard")

,nric,address,nric_clean
0,770305021234,123 Pine Ave.,770305-02-1234
1,771305-02-1234,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `compact`

In [4]:
clean_my_nric(df, column = "nric", output_format="compact")

,nric,address,nric_clean
0,770305021234,123 Pine Ave.,770305021234
1,771305-02-1234,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `birthdate`

In [5]:
clean_my_nric(df, column = "nric", output_format="birthdate")

,nric,address,nric_clean
0,770305021234,123 Pine Ave.,1977-03-05
1,771305-02-1234,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `birthplace`

In [6]:
clean_my_nric(df, column = "nric", output_format="birthplace")

,nric,address,nric_clean
0,770305021234,123 Pine Ave.,"{'state': 'Kedah', 'country': 'Malaysia', 'cou..."
1,771305-02-1234,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned NRIC strings is added with a title in the format `"{original title}_clean"`.

In [7]:
clean_my_nric(df, column="nric", inplace=True)

       nric_clean                                           address
0  770305-02-1234                                     123 Pine Ave.
1             NaN                                           main st
2             NaN                      1234 west main heights 57033
3             NaN                    apt 1 789 s maple rd manhattan
4             NaN                robie house, 789 north main street
5             NaN         1111 S Figueroa St, Los Angeles, CA 90015
6             NaN  (staples center) 1111 S Figueroa St, Los Angeles
7             NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [8]:
clean_my_nric(df, "nric", errors="coerce")

,nric,address,nric_clean
0,770305021234,123 Pine Ave.,770305-02-1234
1,771305-02-1234,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `ignore`

In [9]:
clean_my_nric(df, "nric", errors="ignore")

,nric,address,nric_clean
0,770305021234,123 Pine Ave.,770305-02-1234
1,771305-02-1234,main st,771305-02-1234
2,999 999 999,1234 west main heights 57033,999 999 999
3,004085616,apt 1 789 s maple rd manhattan,004085616
4,002 724 334,"robie house, 789 north main street",002 724 334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_my_nric()`

`validate_my_nric()` returns `True` when the input is a valid NRIC. Otherwise it returns `False`.

The input of `validate_my_nric()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_my_nric()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_my_nric()` returns the validation result for the whole DataFrame.

In [10]:
from dataprep.clean import validate_my_nric
print(validate_my_nric("770305021234"))
print(validate_my_nric("771305-02-1234"))
print(validate_my_nric("999 999 999"))
print(validate_my_nric("51824753556"))
print(validate_my_nric("004085616"))
print(validate_my_nric("hello"))
print(validate_my_nric(np.nan))
print(validate_my_nric("NULL"))

True
False
False
False
False
False
False
False

### Series

In [11]:
validate_my_nric(df["nric"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: nric, dtype: bool

### DataFrame + Specify Column

In [12]:
validate_my_nric(df, column="nric")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: nric, dtype: bool

### Only DataFrame

In [13]:
validate_my_nric(df)

    nric  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False